[
    {
                                        element: document.querySelector('#planing-component'),
                                        intro: '<p>Im Fernstudium sind Sie besonders gefordert, sich selbst zu organisieren und das Lernpensum gut einzuteilen. Wir wissen, dass viele von Ihnen berufstätig sind oder das Fernstudium gewählt haben, da sie die damit verbundene Flexibilität schätzen und brauchen. Dies stellt Sie gleichsam aber auch vor die Herausforderung, Ihr Semester eigenständig zu planen, sich selbst zu disziplinieren und die Übersicht zu behalten. Die Formulierung von Meilensteinen als Teilschritte auf dem Weg zu Ihrem persönlichen Ziel oder zur Prüfung helfen dabei, das Volumen eines Semesters übersichtlich zu machen, es zu strukturieren, zu organisieren und das Ziel im Auge zu behalten. Man darf dann auch auf jeden erreichten Meilenstein ein wenig stolz sein und sich selbst belohnen.</p>',
                                        position: 'bottom',
                                        step: 1
    },
    {
                                        element: document.querySelector('#add-milestone'),
                                        intro: 'Für Ihre Semesterplanung können Sie Meilensteine auch selbst hinzufügen.',
                                        position: 'bottom',
                                        step: 2
    },
    {
                                        element: document.querySelector('#milestone-list-tab'),
                                        intro: 'Hier können Sie die Meilensteine als Liste sehen.',
                                        position: 'top',
                                        step: 3
    },
    {
                                        element: document.querySelector('.milestone-element-name'),
                                        intro: 'In der ersten Spalte ist der Name der Meilensteine zu sehen.',
                                        position: 'top',
                                        step: 4
    },
    {
                                        element: document.querySelector('.milestone-element-due'),
                                        intro: 'Hier sehen Sie, wie viel Zeit Ihnen bis zum Abschluss des Meilensteins bleibt.',
                                        position: 'top',
                                        step: 5
    },
    {
                                        element: document.querySelector('.milestone-element-edit'),
                                        intro: 'Durch einen Klick auf den Stift in der Listenansicht kann man in den Bearbeitungsmodus wechseln.',
                                        position: 'top',
                                        step: 6
    },
    {
                                        element: document.querySelector('.modal'),
                                        intro: 'Effektiv Lernende setzen sich Teilziele in ihrem Lernprozess, wir nennen sie Meilensteine. Je nach Erfahrung und Vorlieben können Meilensteine große Aufgabenketten beschreiben oder kleine geschlossene Arbeitspakete darstellen. Eines ist jedoch allen gemein: sie verfolgen ein konkretes Ziel. Im Fernstudium ist das in der Regel ein Lernziel, wie z.B. einen bestimmten Wissensstand zu erreichen oder eine Fertigkeit, die in einer bestimmten Qualität beherrscht werden soll. <br> Um einen Meilensteinen zu gestalten, ist neben dem Lernziel der Zeitraum, die Themen, Materialien und Aktivitäten und eine passende Lernstrategie zu wählen.',
                                        position: 'top',
                                        step: 7
    },
    {
                                        element: document.querySelector('#modal-strategies'),
                                        intro: 'Lernstrategien können den Lernprozess positiv beeinflussen. Studien haben gezeigt, dass Lernende, die ein gewisses Repertoire an Lernstrategien gut nutzen, auch bei knappen zeitlichen Ressourcen und hohem Stress in der Lage sind, bessere Leistungen zu erbringen. Lernen ist also nicht nur abhängig von der Zeit, die man zur Verfügung hat, sondern auch davon, wie diese genutzt wird. Dabei bewähren sich manche Lernstrategien durch Automation, manche jedoch auch, indem sie im Zusammenspiel mit bestimmten Herausforderungen besser funktionieren. <br> Unser Tipp: Lernen Sie sich und Ihre Lernstrategien besser kennen und probieren Sie gerne auch einmal etwas Neues aus.Beim Klick auf das „?“ wird kurz erklärt, worum es geht.',
                                        position: 'top',
                                        step: 8
    },
    {
                                        element: document.querySelector('.milestone-element-progress'),
                                        intro: 'Der grüne Balken drückt aus, wie weit die Bearbeitung schon fortgeschritten ist. Sind alle Materialien abgearbeitet werden sie abgehakt, die Lernstrategien müssen durch abhaken bestätigt werden oder können gelöscht werden, wenn sie nicht genutzt wurden. Ist der Meilenstein erledigt, dann ist es Zeit für die Reflexion. Sie hilft Ihnen zu überlegen, was gut geklappt hat und was Sie ggf. besser machen könnten. Mit der Beantwortung der letzten Frage können Sie einen persönlichen Lernhinweis festhalten, damit Sie die nächste Lernsession noch besser gestalten. Das gilt ganz besonders dann, wenn es einmal mit der Zielerreichung nicht so ganz geklappt hat. Wir lernen auch durch Fehler.',
                                        position: 'top',
                                        step: 9
    },
    /* Milestone timeline chart */
    {
                                        element: document.querySelector('#milestone-timeline-tab'),
                                        intro: 'Sie können sich die Meilensteine auch als Zeitleiste anzeigen lassen.',
                                        position: 'top',
                                        step: 10
    },
    {
                                        element: document.querySelector('.milestone-chart-container'),
                                        intro: 'In der oberen Zeitleiste werden Meilensteine dargestellt.',
                                        position: 'top',
                                        step: 11
    },
    {
                                        element: document.querySelector('.activity-chart-container'),
                                        intro: 'Im mittleren Teil sehen Sie, in welchen Bereichen Sie im Kurs bereits aktiv waren. Auf der X-Achse ist die Zeit abgebildet. Die Größe der Punkte zeigt Ihnen an, wie aktiv Sie waren.',
                                        position: 'top',
                                        step: 12
    },
    {
                                        element: document.querySelector('.filter-chart-container'),
                                        intro: 'Diese Zeitleiste umfasst das gesamte Semester und ermöglicht Ihnen, den Betrachtungszeitraum der oberen Zeitleisten durch die äußeren Schieber auf Stunden, Tage oder Wochen zu begrenzen.',
                                        position: 'top',
                                        step: 13
    },
    {
                                        element: document.querySelector('.time-filters'),
                                        intro: 'Hier können Sie auch noch weitere Filter nutzen.',
                                        position: 'top',
                                        step: 14
    }
]